---
kind: method
id: M:Autodesk.Revit.UI.DockablePaneState.#ctor(Autodesk.Revit.UI.DockablePaneState)
source: html/58c79873-9e2c-b9ac-2c5d-a3cf5538c90a.htm
---
# Autodesk.Revit.UI.DockablePaneState.#ctor Method

Constructs a new copy of the input DockablePaneState object.

## Syntax (C#)
```csharp
public DockablePaneState(
	DockablePaneState other
)
```

## Parameters
- **other** (`Autodesk.Revit.UI.DockablePaneState`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null